update read,me
